Repository: pypi-data/pypi-mirror-300
Catalog: packages/rmqaio/rmqaio-0.6.0.tar.gz/rmqaio-0.6.0/rmqaio/locales/*/LC_MESSAGES/rmqaio.po
Languages: ru

source: %s (%s %s) retry(%s) in %s second(s)
ru: %s (%s %s) повтор(%s) через %s секунд(у)

source: %s unclosed
ru: %s не закрыто

source: %s execute callback[tp=%s, name=%s, reraise=%s]
ru: %s выполняю callback[tp=%s, name=%s, reraise=%s]

source: %s callback[tp=%s, name=%s, callback=%s] error
ru: %s ошибка выполнения callback[tp=%s, name=%s, callback=%s]

source: %s set callback[tp=%s, name=%s, callback=%s]
ru: %s устанавливаю callback[tp=%s, name=%s, callback=%s]

source: %s connection lost
ru: %s соединение потеряно

source: %s connecting[timeout=%s]...
ru: %s подключаюсь[тайм-аут=%s]...

source: %s connected
ru: %s подключено

source: %s close underlying connection
ru: %s закрываю внутреннее соединение

source: %s closed
ru: %s закрыто

source: close %s
ru: закрываю %s

source: exchange[name='%s'] channel[%s] publish[routing_key='%s'] %s
ru: обменник[name='%s'] канал[%s] публикую[routing_key='%s'] %s

source: close[delete=%s] %s
ru: закрываю[delete=%s] %s

source: declare[restore=%s, force=%s] %s
ru: объявляю[restore=%s, force=%s] %s

source: bind queue '%s' to exchange '%s' with routing_key '%s'
ru: привязываю очередь '%s' к обменнику '%s' с ключом маршрутизации '%s'

source: unbind queue '%s' from exchange '%s' for routing_key '%s'
ru: отвязываю очередь '%s' от обменника '%s' для ключа маршрутизации '%s'

source: consume %s
ru: слушаю %s

source: stop consume %s
ru: перестаю слушать %s
