# CY3761 | fb764bc@outlook.com | 2024-10-03 10:18 | 00.py
# ----------------------------------------------------------------------------------------------------
# pip list | 如果一大堆列表 表示这个非 venv 环境
# 默认 venv 环境 只有一个第三方项目 | pip
# pip list --trusted-host mirrors.aliyun.com (第一次需要设置 --trusted-host)
# python.exe -m pip install --upgrade pip
# pip install -U CY3761
# CY3761 | 2024.1002.1804
# pip | 24.2
# 暂时未知 阿里云镜像 (https://developer.aliyun.com/mirror/pypi) 多久更新一次
# ----------------------------------------------------------------------------------------------------
from CY3761.u00 import main as u00_main


# ----------------------------------------------------------------------------------------------------
def main():
    print(u00_main(1, 1.1, 1e3))
    pass


# ----------------------------------------------------------------------------------------------------
if __name__ == '__main__':
    main()
